ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32670/Libraries/PeriphDrivers/Source/WDT/wdt_revb_regs.h
 #define MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS          16 /**< CTRL_INT_EARLY_VAL Position */
 #define MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL              ((uint32_t)(0xFUL << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS)) /**< CTRL_INT_EARLY_VAL Mask */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW31    ((uint32_t)0x0UL) /**< CTRL_INT_EARLY_VAL_WDT2POW31 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW31    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW31 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW31 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW30    ((uint32_t)0x1UL) /**< CTRL_INT_EARLY_VAL_WDT2POW30 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW30    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW30 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW30 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW29    ((uint32_t)0x2UL) /**< CTRL_INT_EARLY_VAL_WDT2POW29 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW29    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW29 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW29 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW28    ((uint32_t)0x3UL) /**< CTRL_INT_EARLY_VAL_WDT2POW28 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW28    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW28 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW28 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW27    ((uint32_t)0x4UL) /**< CTRL_INT_EARLY_VAL_WDT2POW27 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW27    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW27 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW27 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW26    ((uint32_t)0x5UL) /**< CTRL_INT_EARLY_VAL_WDT2POW26 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW26    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW26 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW26 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW25    ((uint32_t)0x6UL) /**< CTRL_INT_EARLY_VAL_WDT2POW25 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW25    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW25 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW25 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW24    ((uint32_t)0x7UL) /**< CTRL_INT_EARLY_VAL_WDT2POW24 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW24    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW24 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW24 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW23    ((uint32_t)0x8UL) /**< CTRL_INT_EARLY_VAL_WDT2POW23 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW23    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW23 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW23 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW22    ((uint32_t)0x9UL) /**< CTRL_INT_EARLY_VAL_WDT2POW22 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW22    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW22 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW22 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW21    ((uint32_t)0xAUL) /**< CTRL_INT_EARLY_VAL_WDT2POW21 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW21    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW21 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW21 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW20    ((uint32_t)0xBUL) /**< CTRL_INT_EARLY_VAL_WDT2POW20 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW20    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW20 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW20 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW19    ((uint32_t)0xCUL) /**< CTRL_INT_EARLY_VAL_WDT2POW19 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW19    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW19 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW19 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW18    ((uint32_t)0xDUL) /**< CTRL_INT_EARLY_VAL_WDT2POW18 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW18    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW18 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW18 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW17    ((uint32_t)0xEUL) /**< CTRL_INT_EARLY_VAL_WDT2POW17 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW17    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW17 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW17 Setting */
 #define MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW16    ((uint32_t)0xFUL) /**< CTRL_INT_EARLY_VAL_WDT2POW16 Value */
 #define MXC_S_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW16    (MXC_V_WDT_REVB_CTRL_INT_EARLY_VAL_WDT2POW16 << MXC_F_WDT_REVB_CTRL_INT_EARLY_VAL_POS) /**< CTRL_INT_EARLY_VAL_WDT2POW16 Setting */

 #define MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS          20 /**< CTRL_RST_EARLY_VAL Position */
 #define MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL              ((uint32_t)(0xFUL << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS)) /**< CTRL_RST_EARLY_VAL Mask */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW31    ((uint32_t)0x0UL) /**< CTRL_RST_EARLY_VAL_WDT2POW31 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW31    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW31 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW31 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW30    ((uint32_t)0x1UL) /**< CTRL_RST_EARLY_VAL_WDT2POW30 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW30    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW30 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW30 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW29    ((uint32_t)0x2UL) /**< CTRL_RST_EARLY_VAL_WDT2POW29 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW29    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW29 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW29 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW28    ((uint32_t)0x3UL) /**< CTRL_RST_EARLY_VAL_WDT2POW28 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW28    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW28 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW28 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW27    ((uint32_t)0x4UL) /**< CTRL_RST_EARLY_VAL_WDT2POW27 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW27    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW27 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW27 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW26    ((uint32_t)0x5UL) /**< CTRL_RST_EARLY_VAL_WDT2POW26 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW26    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW26 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW26 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW25    ((uint32_t)0x6UL) /**< CTRL_RST_EARLY_VAL_WDT2POW25 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW25    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW25 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW25 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW24    ((uint32_t)0x7UL) /**< CTRL_RST_EARLY_VAL_WDT2POW24 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW24    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW24 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW24 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW23    ((uint32_t)0x8UL) /**< CTRL_RST_EARLY_VAL_WDT2POW23 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW23    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW23 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW23 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW22    ((uint32_t)0x9UL) /**< CTRL_RST_EARLY_VAL_WDT2POW22 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW22    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW22 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW22 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW21    ((uint32_t)0xAUL) /**< CTRL_RST_EARLY_VAL_WDT2POW21 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW21    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW21 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW21 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW20    ((uint32_t)0xBUL) /**< CTRL_RST_EARLY_VAL_WDT2POW20 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW20    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW20 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW20 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW19    ((uint32_t)0xCUL) /**< CTRL_RST_EARLY_VAL_WDT2POW19 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW19    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW19 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW19 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW18    ((uint32_t)0xDUL) /**< CTRL_RST_EARLY_VAL_WDT2POW18 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW18    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW18 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW18 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW17    ((uint32_t)0xEUL) /**< CTRL_RST_EARLY_VAL_WDT2POW17 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW17    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW17 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW17 Setting */
 #define MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW16    ((uint32_t)0xFUL) /**< CTRL_RST_EARLY_VAL_WDT2POW16 Value */
 #define MXC_S_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW16    (MXC_V_WDT_REVB_CTRL_RST_EARLY_VAL_WDT2POW16 << MXC_F_WDT_REVB_CTRL_RST_EARLY_VAL_POS) /**< CTRL_RST_EARLY_VAL_WDT2POW16 Setting */

 #define MXC_F_WDT_REVB_CTRL_CLKRDY_IE_POS              27 /**< CTRL_CLKRDY_IE Position */
 #define MXC_F_WDT_REVB_CTRL_CLKRDY_IE                  ((uint32_t)(0x1UL << MXC_F_WDT_REVB_CTRL_CLKRDY_IE_POS)) /**< CTRL_CLKRDY_IE Mask */

 #define MXC_F_WDT_REVB_CTRL_CLKRDY_POS                 28 /**< CTRL_CLKRDY Position */
 #define MXC_F_WDT_REVB_CTRL_CLKRDY                     ((uint32_t)(0x1UL << MXC_F_WDT_REVB_CTRL_CLKRDY_POS)) /**< CTRL_CLKRDY Mask */

 #define MXC_F_WDT_REVB_CTRL_WIN_EN_POS                 29 /**< CTRL_WIN_EN Position */
 #define MXC_F_WDT_REVB_CTRL_WIN_EN                     ((uint32_t)(0x1UL << MXC_F_WDT_REVB_CTRL_WIN_EN_POS)) /**< CTRL_WIN_EN Mask */

 #define MXC_F_WDT_REVB_CTRL_RST_EARLY_POS              30 /**< CTRL_RST_EARLY Position */
 #define MXC_F_WDT_REVB_CTRL_RST_EARLY                  ((uint32_t)(0x1UL << MXC_F_WDT_REVB_CTRL_RST_EARLY_POS)) /**< CTRL_RST_EARLY Mask */

