ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32670/Libraries/PeriphDrivers/Source/WDT/wdt_revb_regs.h
 #define MXC_F_WDT_REVB_CTRL_RST_LATE_POS               31 /**< CTRL_RST_LATE Position */
 #define MXC_F_WDT_REVB_CTRL_RST_LATE                   ((uint32_t)(0x1UL << MXC_F_WDT_REVB_CTRL_RST_LATE_POS)) /**< CTRL_RST_LATE Mask */

/**@} end of group WDT_REVB_CTRL_Register */

/**
 * @ingroup  wdt_revb_registers
 * @defgroup WDT_REVB_RST WDT_REVB_RST
 * @brief    Windowed Watchdog Timer Reset Register.
 * @{
 */
 #define MXC_F_WDT_REVB_RST_RESET_POS                   0 /**< RST_RESET Position */
 #define MXC_F_WDT_REVB_RST_RESET                       ((uint32_t)(0xFFUL << MXC_F_WDT_REVB_RST_RESET_POS)) /**< RST_RESET Mask */
 #define MXC_V_WDT_REVB_RST_RESET_SEQ0                  ((uint32_t)0xA5UL) /**< RST_RESET_SEQ0 Value */
 #define MXC_S_WDT_REVB_RST_RESET_SEQ0                  (MXC_V_WDT_REVB_RST_RESET_SEQ0 << MXC_F_WDT_REVB_RST_RESET_POS) /**< RST_RESET_SEQ0 Setting */
 #define MXC_V_WDT_REVB_RST_RESET_SEQ1                  ((uint32_t)0x5AUL) /**< RST_RESET_SEQ1 Value */
 #define MXC_S_WDT_REVB_RST_RESET_SEQ1                  (MXC_V_WDT_REVB_RST_RESET_SEQ1 << MXC_F_WDT_REVB_RST_RESET_POS) /**< RST_RESET_SEQ1 Setting */

/**@} end of group WDT_REVB_RST_Register */

/**
 * @ingroup  wdt_revb_registers
 * @defgroup WDT_REVB_CLKSEL WDT_REVB_CLKSEL
 * @brief    Windowed Watchdog Timer Clock Select Register.
 * @{
 */
 #define MXC_F_WDT_REVB_CLKSEL_SOURCE_POS               0 /**< CLKSEL_SOURCE Position */
 #define MXC_F_WDT_REVB_CLKSEL_SOURCE                   ((uint32_t)(0x7UL << MXC_F_WDT_REVB_CLKSEL_SOURCE_POS)) /**< CLKSEL_SOURCE Mask */

/**@} end of group WDT_REVB_CLKSEL_Register */

/**
 * @ingroup  wdt_revb_registers
 * @defgroup WDT_REVB_CNT WDT_REVB_CNT
 * @brief    Windowed Watchdog Timer Count Register.
 * @{
 */
 #define MXC_F_WDT_REVB_CNT_COUNT_POS                   0 /**< CNT_COUNT Position */
 #define MXC_F_WDT_REVB_CNT_COUNT                       ((uint32_t)(0xFFFFFFFFUL << MXC_F_WDT_REVB_CNT_COUNT_POS)) /**< CNT_COUNT Mask */

/**@} end of group WDT_REVB_CNT_Register */

#ifdef __cplusplus
}
#endif

#endif /* _WDT_REVB_REGS_H_ */
